In [2]:
import pandas as pd
import numpy as np

Example:1

In [5]:
data=pd.DataFrame({'Name':['Avery Bradly','John Holland','Jonas Jerebco','Jorden mickey','Terry Rozier','Jarred Sellinger','Evan Tucner'],
                  'Team':['Boston Celtics','Boston Celtics','Boston Celtics','Boston Celtics','Boston Celtics','Boston Celtics','Boston Celtics'],
                  'Number':[0.0,30.0,8.0,"nan",12.0,7.0,11.0],
                  'Position':['PG','SG','PF','PF','PG','C','SG'],
                  'Age':[25.0,27.0,29.0,21.0,22.0,"nan",27.0]})
data

               Name            Team Number Position   Age
0      Avery Bradly  Boston Celtics    0.0       PG  25.0
1      John Holland  Boston Celtics   30.0       SG  27.0
2     Jonas Jerebco  Boston Celtics    8.0       PF  29.0
3     Jorden mickey  Boston Celtics    nan       PF  21.0
4      Terry Rozier  Boston Celtics   12.0       PG  22.0
5  Jarred Sellinger  Boston Celtics    7.0        C   nan
6       Evan Tucner  Boston Celtics   11.0       SG  27.0

In [7]:
#no.of row and column
data.shape

(7, 5)

In [8]:
# total no. of element
data.size

35

In [10]:
#check index
data.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
#column name
data.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age'], dtype='object')

In [16]:
len(data)

7

In [17]:
# check  how many rows
data.shape[0]

7

In [18]:
#check how many columns
data.shape[1]

5

In [21]:
data.Name

0        Avery Bradly
1        John Holland
2       Jonas Jerebco
3       Jorden mickey
4        Terry Rozier
5    Jarred Sellinger
6         Evan Tucner
Name: Name, dtype: object

In [22]:
data.Team

0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3    Boston Celtics
4    Boston Celtics
5    Boston Celtics
6    Boston Celtics
Name: Team, dtype: object

In [35]:
data[['Name','Team']]

               Name            Team
0      Avery Bradly  Boston Celtics
1      John Holland  Boston Celtics
2     Jonas Jerebco  Boston Celtics
3     Jorden mickey  Boston Celtics
4      Terry Rozier  Boston Celtics
5  Jarred Sellinger  Boston Celtics
6       Evan Tucner  Boston Celtics

In [23]:
data.head()

            Name            Team Number Position   Age
0   Avery Bradly  Boston Celtics    0.0       PG  25.0
1   John Holland  Boston Celtics   30.0       SG  27.0
2  Jonas Jerebco  Boston Celtics    8.0       PF  29.0
3  Jorden mickey  Boston Celtics    nan       PF  21.0
4   Terry Rozier  Boston Celtics   12.0       PG  22.0

In [25]:
data.tail()

               Name            Team Number Position   Age
2     Jonas Jerebco  Boston Celtics    8.0       PF  29.0
3     Jorden mickey  Boston Celtics    nan       PF  21.0
4      Terry Rozier  Boston Celtics   12.0       PG  22.0
5  Jarred Sellinger  Boston Celtics    7.0        C   nan
6       Evan Tucner  Boston Celtics   11.0       SG  27.0

In [29]:
data.to_csv('data1.csv')

In [30]:
data.values

array([['Avery Bradly', 'Boston Celtics', 0.0, 'PG', 25.0],
       ['John Holland', 'Boston Celtics', 30.0, 'SG', 27.0],
       ['Jonas Jerebco', 'Boston Celtics', 8.0, 'PF', 29.0],
       ['Jorden mickey', 'Boston Celtics', 'nan', 'PF', 21.0],
       ['Terry Rozier', 'Boston Celtics', 12.0, 'PG', 22.0],
       ['Jarred Sellinger', 'Boston Celtics', 7.0, 'C', 'nan'],
       ['Evan Tucner', 'Boston Celtics', 11.0, 'SG', 27.0]], dtype=object)

In [51]:
data.query('Name=="Evan Tucner" & Team=="Boston Celtics"')

          Name            Team Number Position   Age
6  Evan Tucner  Boston Celtics   11.0       SG  27.0

In [48]:
data.query('Age==25')

           Name            Team Number Position   Age
0  Avery Bradly  Boston Celtics    0.0       PG  25.0

In [55]:

data.query('(Name=="Avery Bradly") and (Team=="CSK")')

Empty DataFrame
Columns: [Name, Team, Number, Position, Age]
Index: []

In [58]:
#name ending with(r)
data.Name.str.endswith('r')

0    False
1    False
2    False
3    False
4     True
5     True
6     True
Name: Name, dtype: bool

In [60]:
data[data.Name.str.endswith('r')]

               Name            Team Number Position   Age
4      Terry Rozier  Boston Celtics   12.0       PG  22.0
5  Jarred Sellinger  Boston Celtics    7.0        C   nan
6       Evan Tucner  Boston Celtics   11.0       SG  27.0

In [62]:
data[data.Name.apply(lambda nm:nm.endswith('y'))]

            Name            Team Number Position   Age
0   Avery Bradly  Boston Celtics    0.0       PG  25.0
3  Jorden mickey  Boston Celtics    nan       PF  21.0

In [64]:
data.query('Position=="C"')

               Name            Team Number Position  Age
5  Jarred Sellinger  Boston Celtics    7.0        C  nan

In [65]:
data.query('Number=="nan"')

            Name            Team Number Position   Age
3  Jorden mickey  Boston Celtics    nan       PF  21.0

Example:2

In [67]:
data=pd.DataFrame({'Name':['Jack','Riti','Tom','Neelu','John','Mike'],
                  'Age':[34,30,31,32,16,17],
                  'City':['Sydney','Delhi','Mumbai','Bangalore','New York','las vegas'],
                  'Country':['Austrailia','India','India','India','US','US'],
                  'Course':['Computer science','Computer science','Computer science','Computer science','Computer science','Computer science'],
                  'Grade':['A','A','A','A','A','A']})
data

    Name  Age       City     Country            Course Grade
0   Jack   34     Sydney  Austrailia  Computer science     A
1   Riti   30      Delhi       India  Computer science     A
2    Tom   31     Mumbai       India  Computer science     A
3  Neelu   32  Bangalore       India  Computer science     A
4   John   16   New York          US  Computer science     A
5   Mike   17  las vegas          US  Computer science     A

In [68]:
len(data)

6

In [69]:
#total no of element
data.size

36

In [70]:
# no of row and column
data.shape

(6, 6)

In [71]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [72]:
data.Country

0    Austrailia
1         India
2         India
3         India
4            US
5            US
Name: Country, dtype: object

In [75]:
data[['Name','Course']]

    Name            Course
0   Jack  Computer science
1   Riti  Computer science
2    Tom  Computer science
3  Neelu  Computer science
4   John  Computer science
5   Mike  Computer science

In [77]:
data.head()

    Name  Age       City     Country            Course Grade
0   Jack   34     Sydney  Austrailia  Computer science     A
1   Riti   30      Delhi       India  Computer science     A
2    Tom   31     Mumbai       India  Computer science     A
3  Neelu   32  Bangalore       India  Computer science     A
4   John   16   New York          US  Computer science     A

In [78]:
data.tail()

    Name  Age       City Country            Course Grade
1   Riti   30      Delhi   India  Computer science     A
2    Tom   31     Mumbai   India  Computer science     A
3  Neelu   32  Bangalore   India  Computer science     A
4   John   16   New York      US  Computer science     A
5   Mike   17  las vegas      US  Computer science     A

In [100]:
data.to_csv('data2.csv')

In [80]:
data.columns

Index(['Name', 'Age', 'City', 'Country', 'Course', 'Grade'], dtype='object')

In [81]:
data.values

array([['Jack', 34, 'Sydney', 'Austrailia', 'Computer science', 'A'],
       ['Riti', 30, 'Delhi', 'India', 'Computer science', 'A'],
       ['Tom', 31, 'Mumbai', 'India', 'Computer science', 'A'],
       ['Neelu', 32, 'Bangalore', 'India', 'Computer science', 'A'],
       ['John', 16, 'New York', 'US', 'Computer science', 'A'],
       ['Mike', 17, 'las vegas', 'US', 'Computer science', 'A']],
      dtype=object)

In [87]:
#no. of rows
data.shape[0]

6

In [88]:
#no of columns
data.shape[1]

6

In [89]:
data.query('Country=="India"')

    Name  Age       City Country            Course Grade
1   Riti   30      Delhi   India  Computer science     A
2    Tom   31     Mumbai   India  Computer science     A
3  Neelu   32  Bangalore   India  Computer science     A

In [90]:
data.City.str.endswith('i')

0    False
1     True
2     True
3    False
4    False
5    False
Name: City, dtype: bool

In [91]:
data[data.City.str.endswith('i')]

   Name  Age    City Country            Course Grade
1  Riti   30   Delhi   India  Computer science     A
2   Tom   31  Mumbai   India  Computer science     A

In [95]:
data.Name.apply(len)==4

0     True
1     True
2    False
3    False
4     True
5     True
Name: Name, dtype: bool

In [99]:
data.Country.apply(len).min()

np.int64(2)